Revit 2027 API
RebarUpdateCurvesData.GetBarNominalDiameter Method
 Gets the nominal diameter of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetBarNominalDiameter()
Public Function GetBarNominalDiameter As Double
public:
double GetBarNominalDiameter()
member GetBarNominalDiameter : unit -> float
Return Value
Double
 Returns the nominal diameter of the Rebar.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace